---
kind: other
id: Methods.T:Autodesk.Revit.DB.FilterStringRuleEvaluator
source: html/f316c38f-8679-4808-745e-76a00f888445.htm
---
# FilterStringRuleEvaluator Methods

Derived classes override this method to implement the test that determines
 whether the two given string values satisfy the desired condition or not.